/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1
*/

/*void SecDig()
{
    Console.WriteLine("Input your 3 digit number ");
    int user_number = Convert.ToInt32(Console.ReadLine());

    if (user_number > 100 && user_number < 1000)
    {
        int second_digit = (user_number / 10) % 10;
        Console.WriteLine("Second digit is: " + second_digit);
    }
    else
    {
        Console.WriteLine("You enter wrong number.");
    }
}
SecDig();*/

